#include "cross_cross.h"

царь_батюшка_главный() {
	вперёд_славяне;

	Русь::читать_летопись файл("task_13_8_student.txt");
	Русь::string ФИО;
	Русь::зачерпнуть(файл, ФИО, '\n');

	приказ_княжий int размерчик = 5;
	int оценки[размерчик];
	int суммка = 0;

	для (int и = 0; и < размерчик; и++) {
		файл >> оценки[и];
		суммка += оценки[и];
	}
	файл.close();

	Русь::молвить << "Студент: " << ФИО << Русь::прыг_скок;
	Русь::молвить << "Средняя оценка: "
				 << суммка / размерчик << Русь::прыг_скок;

	воздать 0;
}
